{
  "TopBar": {
    "home": "Home",
    "projects": "Projects",
    "services": "Services",
    "contact": "Contact",
    "project-btn": "A project ?"
  },
  "Home": {
    "developer": "Developer",
    "message": "Hello 👋\nI’m Nicolas SANS, an experienced full-stack developer passionate about the web, robust, reliable, and innovative solutions.\n\nWith a five-year degree from Epitech Nantes, I honed my expertise through roles as a consultant and Salesforce developer at Capgemini NANTES, where I am currently continuing my journey. Driven by a love for technical challenges and a constant search for efficient solutions, I specialize in Rust 🦀, a high-performance language that enables me to design resource-efficient projects, supporting a more eco-friendly approach to development.\n\nMy experience includes a wide range of solutions, from native and cross-platform mobile applications in React Native and Flutter 📱 to IoT projects with ESP32 in C and C++. During my studies, I also developed a SaaS application using React, NestJS, and MongoDB to meet practical needs of my peers.\n\nIn parallel, I built and managed a bare-metal Kubernetes cluster, complete with a GitOps architecture, ensuring reliable and automated deployments.\n\nI am serious, adaptable, and enjoy both the design and deployment of complex projects. My expertise also includes implementing robust solutions on AWS and Azure, with proven experience on large-scale projects (up to 300,000 clients).\n\nI am currently open to part-time projects. Contact me to discuss your ideas!"
  },
  "Projects": {
    "title": "Projects",
    "subtitle": "Discover my projects and solutions, carefully designed to combine robustness, reliability, and innovation. Whether it’s web development, mobile applications, or cloud solutions, each project is crafted to meet real needs and deliver an efficient and lasting experience.\n\n",
    "see-all": "See all",
    "see-on-github": "See on GitHub",
    "pld": {
      "title": "PldMaker",
      "description": "PLD Maker is a SaaS that helps users manage their projects by generating fully customizable PDF tracking files. The tool offers features tailored to meet various tracking and management needs."
    },
    "atrip": {
      "title": "ATrip",
      "description": "Trip Planner is a web application built with Next.js and a microservices backend using NestJS, designed for efficient and performant trip planning.\nThe project started with a Figma prototype, which helped define the user requirements before development. This user-centered approach ensures a robust and tailored solution."
    },
    "fbx": {
      "title": "fbx-cli",
      "description": "fbx-cli is a command-line tool (CLI) that allows you to control and manage a Freebox remotely. It offers a simple and efficient interface to interact with the Freebox without using the web interface."
    },
    "iot": {
      "title": "IOTSensorSensei",
      "description": "IOTSensorSensei is a school project focused on collecting data from sensors on an ESP32, transmitting it via LoRa, retrieving it on another ESP32, and sending it to an API for visualization."
    },
    "cloud": {
      "title": "T-Cloud",
      "description": "T-Cloud is a school project involving setting up a bare metal Kubernetes cluster with three nodes, integrating IaaS, DevOps, and GitOps practices."
    },
    "argames": {
      "title": "ARGames",
      "description": "ARGames is a graduation project aimed at creating an augmented reality game, where ESP32s activate mechanisms (lights, sound, drawers) to progress the player on mobile or tablet."
    },
    "myrpg": {
      "title": "MyRPG",
      "description": "MyRPG is a first-year Epitech project aimed at creating an RPG in C, using only the CSFM library."
    }
  },
  "Services": {
    "application": {
      "title": "Application",
      "fullstack": {
        "title": "Fullstack Web Application Development",
        "description": "Designing modern, interactive web applications optimized for performance and user experience. Using Next.js, React, and Tailwind CSS to build scalable solutions tailored to specific needs."
      },
      "api": {
        "title": "Development of Robust, High-Performance, and Secure APIs",
        "description": "Building APIs in Rust or Node.js to ensure optimal performance and advanced security. Solutions designed to meet diverse needs and enable seamless communication between systems."
      },
      "optimization": {
        "title": "Website Optimization and Redesign",
        "description": "Improving website speed, accessibility, and SEO to enhance the user experience. Providing redesign proposals and feature upgrades to boost user engagement."
      },
      "integration": {
        "title": "Integration of Management Features",
        "description": "Integrating tools for task, subscription, and expense management, tailored for multi-user environments. These features are designed to facilitate collaboration and address the needs of various teams and users."
      }
    },
    "mobile": {
      "title": "Mobile",
      "native": {
        "title": "Native Android Development",
        "description": "Creating native Android applications optimized for high performance and full integration of platform-specific features. Custom-designed to deliver a smooth and responsive user experience."
      },
      "cross": {
        "title": "Cross-Platform Android and iOS Development",
        "description": "Developing cross-platform mobile applications with React Native, targeting both Android and iOS. Optimizing features to ensure a consistent and high-performing experience across both platforms."
      },
      "optimize": {
        "title": "Application Deployment and Optimization",
        "description": "Comprehensive management of app deployment on Google Play Store and Apple App Store, with performance and compatibility optimization. Implementing best practices for a smooth launch and stable performance."
      }
    },
    "devops": {
      "title": "DevOps",
      "ci": {
        "title": "Continuous Integration Setup and Configuration",
        "description": "Setting up continuous integration (CI) pipelines to automate testing, builds, and deployments. Enhancing productivity and code quality with optimized and reliable development processes."
      },
      "orchestration": {
        "title": "Containerization and Orchestration",
        "description": "Setting up Docker containers and orchestration for flexible and secure application deployment. Optimizing resource management for efficient handling of development and production environments."
      },
      "observability": {
        "title": "Performance Monitoring",
        "description": "Implementing monitoring solutions to analyze application and server performance in real-time. Proactively detecting issues and optimizing performance for maximum availability and responsiveness."
      }
    },
    "salesforce": {
      "title": "Salesforce",
      "integration": {
        "title": "Solution and Integration Development",
        "description": "Designing and developing custom solutions for Salesforce, tailored to the specific needs of each business. Seamlessly integrating with internal processes to enhance efficiency and data management."
      },
      "workflow": {
        "title": "Workflow Automation and Business Process Management",
        "description": "Setting up automated workflows and process management tools in Salesforce to optimize operations and boost productivity. Automating repetitive tasks for better resource allocation."
      },
      "external_app": {
        "title": "Integration of Salesforce with Other Systems and Applications",
        "description": "Integrating Salesforce with external systems and applications to create a unified ecosystem. Synchronizing data and automating workflows between platforms for a seamless user experience."
      },
      "custom": {
        "title": "Custom Application Development in Salesforce",
        "description": "Developing custom applications within Salesforce to meet specific user needs. Creating tailored tools to enhance customer experience and optimize business processes."
      }
    }
  },

  "Contact": {
    "title": "Contact",
    "subtitle": "Want to chat ?",
    "message": "Contact me via this form and I'll get back to you as soon as possible.",
    "form": {
      "firstname": "* Firstname",
      "lastname": "* Lastname",
      "email": "* Email address",
      "company": "Company",
      "message": "* Your message...."
    },
    "send-btn": "Send"
  }
}