{
  "TopBar": {
    "home": "Accueil",
    "projects": "Projets",
    "services": "Services",
    "contact": "Contact",
    "project-btn": "Un projet ?"
  },
  "Home": {
    "developer": "Développeur",
    "": "Bienvenue sur mon portfolio, Je suis Nicolas SANS, développeur fullstack confirmé 👋\n\nDiplômé de cinq années d'études à Epitech Nantes, je suis actuellement freelance",
    "message": "Salut ! Je suis Nicolas, développeur fullstack passionné par les solutions robustes, fiables et innovantes 🚀\n\nDiplômé de cinq années d'études à Epitech Nantes, j'ai forgé mon expertise à travers des missions en tant que consultant et développeur Salesforce chez Capgemini NANTES, où je poursuis actuellement mon aventure. Passionné par les défis techniques et toujours à la recherche de solutions efficientes, je me spécialise en Rust 🦀, un langage performant qui me permet de concevoir des projets à faible consommation de ressources, contribuant à une approche plus écologique du développement.\n\nMon parcours m'a permis de développer des solutions variées, allant d’applications mobiles natives et cross-plateformes en React Native et Flutter 📱, à des projets IoT avec ESP32 en C et C++. J'ai également conçu un SaaS en React, NestJS et MongoDB durant mes études pour répondre à des besoins concrets de mes collègues.\n\nEn parallèle, j'ai construit et administré un cluster Kubernetes bare-metal, accompagné d'une architecture GitOps, assurant un déploiement automatisé et fiable de solutions.\n\nJe suis sérieux, adaptable, et j’apprécie autant la conception que le déploiement de projets complexes. Mon expérience comprend également la mise en œuvre de solutions robustes sur AWS et Azure, avec une expertise éprouvée sur des projets à grande échelle (jusqu’à 300 000 clients).\n\nJe suis actuellement ouvert aux missions à mi-temps. Contactez-moi pour discuter de vos projets !"
  },
  "Projects": {
    "title": "Projets",
    "see-all": "Voir +"
  },
  "Contact": {
    "title": "Contact",
    "subtitle": "Vous souhaitez discuter ?",
    "message": "Contactez-moi via ce formulaire, je vous répondrai dans les meilleurs délais.",
    "form": {
      "firstname": "* Prénom",
      "lastname": "* Nom",
      "email": "* Adresse email",
      "company": "Entreprise",
      "message": "* Votre message...."
    },
    "send-btn": "Envoyer"
  }
}